MuraDaco/mpfw_code_main_tst_20240619main/src/nxp/Src/LPC54608_tst_freertos_original.cpp
/*
 * Copyright 2016-2022 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of NXP Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/**
 * @file    LPC54608_tst_freertos.cpp
 * @brief   Application entry point.
 */


// lib include
#include <krInitStaticManager.h>
#include <krThreadManager.h>
#include <krTimerManager.h>
#include <svStateMachineManager.h>
#include <rsSerial.h>

// tst include
#include <mn/mg/tt_MainManager.h>
#include <sv/svSync/v_01/mn/tt_mn_svSyncMain.h>

// tst/tb include
#include <tb/kr/krInit/v_02/ap_krInitStaticTbl.h>
#include <tb/kr/krThread/v_02/ap_krThreadTbl.h>
#include <tb/kr/krTimer/v_02/ap_krTimerTbl.h>
#include <tb/sv/svStateMachine/v_02/ap_svStateMachineTbl.h>

// ***************************************************

/* FreeRTOS kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "timers.h"

/* Freescale includes. */
#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "board.h"

#include <drivers/freertos/fsl_usart_freertos.h>
#include "fsl_usart.h"

#include <stdbool.h>

// ****

#include "fsl_usart.h"
#include "fsl_gpio.h"


// ****
#include "ds3231.h"


// ****

#include <stdio.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "LPC54608.h"
#include "fsl_debug_console.h"

#include <wrapper/freertos/emphi/th/thThread.h>

/* TODO: insert other include files here. */

/* TODO: insert other definitions and declarations here. */


#include <atomic>

std::atomic<std::uint32_t> 	global_atomic_var_work;
uint32_t 					global_var_work;
uint32_t 					global_var;

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define DEMO_USART USART0
#define DEMO_USART_IRQHandler FLEXCOMM0_IRQHandler
#define DEMO_USART_IRQn FLEXCOMM0_IRQn
/* Task priorities. */
#define uart_task_PRIORITY (configMAX_PRIORITIES - 1)
#define USART_NVIC_PRIO 5

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define BOARD_DEBUG_UART_MARCO_TEST_CLK_ATTACH   kFRO12M_to_FLEXCOMM4

#define DEMO_USART_MARCO_TEST                    USART4
#define DEMO_USART_CLK_FREQ                      CLOCK_GetFlexCommClkFreq(0)
#define DEMO_USART_MARCO_TEST_CLK_FREQ           CLOCK_GetFlexCommClkFreq(0)

// *********************************************
#define APP_BOARD_MARCO_TEST_SW2_PORT 0U
#define APP_BOARD_MARCO_TEST_SW2_PIN  6U

#define APP_BOARD_MARCO_TEST_LED2_PORT 3U
#define APP_BOARD_MARCO_TEST_LED2_PIN  3U

// *********************************************
#define APP_BOARD_MARCO_TEST_SW3_PORT 0U
#define APP_BOARD_MARCO_TEST_SW3_PIN  5U

#define APP_BOARD_MARCO_TEST_LED3_PORT 2U
#define APP_BOARD_MARCO_TEST_LED3_PIN  2U


/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/
//                                            1         2         3         4         5         6
//                                  012345678901234567890123456789012345678901234567890123456789012345678
uint8_t txbuff[]                  = "Usart polling example\r\nPress any key to continue ...\r\n";
uint8_t txbuff_marco[]            = "OK! rs485 Tx works! \r\n Now, press any key to test rs485 Rx ...\r\n";
uint8_t rxbuff[20]                = {0};
// ..................................0123456789012345678901234567890
uint8_t txbuff_show_rx[]          = "the key just pressed is: -\r\n";
uint8_t txbuff_first_msg[]        = "Welcome to USART MARCO test\r\n";

uint8_t txbuff_sw2_status[]       = "sw2 (two) pressed\r\n";
uint8_t txbuff_led2_status_on[]   = "Pin connected to led2 (two) is HIGH\r\n";
uint8_t txbuff_led2_status_off[]  = "Pin connected to led2 (two) is LOW\r\n";

uint8_t txbuff_sw3_status[]       = "sw3 (three) pressed\r\n";
uint8_t txbuff_led3_status_on[]   = "Pin connected to led3 (three) is HIGH\r\n";
uint8_t txbuff_led3_status_off[]  = "Pin connected to led3 (three) is LOW\r\n";


/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void uart_task(void *pvParameters);

