MuraDaco/mpfw_code_main_tst_20240619main/src/nxp/Src/LPC54608_tst_freertos_original.cpp
/*******************************************************************************
 * Code
 ******************************************************************************/
const char *to_send             = "cmkLib T FreeRTOS (static task) USART driver example!\r\n";
const char *send_buffer_overrun = "\r\nRing buffer overrun!\r\n";
uint8_t background_buffer[32];
uint8_t recv_buffer[4];

usart_rtos_handle_t handle;
struct _usart_handle t_handle;

struct rtos_usart_config usart_config = {
    .baudrate    = 115200,
    .parity      = kUSART_ParityDisabled,
    .stopbits    = kUSART_OneStopBit,
    .buffer      = background_buffer,
    .buffer_size = sizeof(background_buffer),
};

#define STACK_SIZE 200



// Structure that will hold the TCB of the task being created.
StaticTask_t xTaskBuffer;

// Buffer that the task being created will use as its stack.  Note this is
// an array of StackType_t variables.  The size of StackType_t is dependent on
// the RTOS port.
StackType_t xStack[ STACK_SIZE ];

void vTaskCodeTest01( void * pvParameters )
{
    // The parameter value is expected to be 1 as 1 is passed in the
    // pvParameters value in the call to xTaskCreateStatic().
    configASSERT( ( uint32_t ) pvParameters == 1UL );
    uint32_t i=0;
    uint32_t local_var_work=0;
    global_var = 1;

    while(1) {
    	local_var_work=global_var_work;
    	local_var_work++;
    	global_var_work++;

    	if(global_var != 1) {
    		if(local_var_work != global_var_work) {
        		PRINTF("Task switch occurred at 0x%x cycle of task 01\r\n",i);
    		}
    		global_var = 1;
    	}
    	i++;
    }
}

void vTaskCodeTest02( void * pvParameters )
{
    // The parameter value is expected to be 1 as 1 is passed in the
    // pvParameters value in the call to xTaskCreateStatic().
    configASSERT( ( uint32_t ) pvParameters == 1UL );
    uint32_t i=0;
    uint32_t local_var_work=0;
    global_var = 2;

    while(1) {
    	local_var_work=global_var_work;
    	local_var_work++;
    	global_var_work++;

    	if(global_var != 2) {
    		if(local_var_work != global_var_work) {
    			PRINTF("Task switch occurred at 0x%x cycle of task 02\r\n",i);
    		}
			global_var = 2;
    	}
    	i++;
    }
}

void vTaskCodeTestAtomic01( void * pvParameters )
{
    // The parameter value is expected to be 1 as 1 is passed in the
    // pvParameters value in the call to xTaskCreateStatic().
    configASSERT( ( uint32_t ) pvParameters == 1UL );
    uint32_t i=0;
    uint32_t local_var_work=0;
    global_var = 1;

    while(1) {
    	local_var_work=global_atomic_var_work;
    	local_var_work++;
    	global_atomic_var_work++;

    	if(global_var != 1) {
    		if(local_var_work != global_atomic_var_work) {
        		PRINTF("Task switch occurred at 0x%x cycle of task 01\r\n",i);
    		}
    		global_var = 1;
    	}
    	i++;
    }
}

void vTaskCodeTestAtomic02( void * pvParameters )
{
    // The parameter value is expected to be 1 as 1 is passed in the
    // pvParameters value in the call to xTaskCreateStatic().
    configASSERT( ( uint32_t ) pvParameters == 1UL );
    uint32_t i=0;
    uint32_t local_var_work=0;
    global_var = 2;

    while(1) {
    	local_var_work=global_atomic_var_work;
    	local_var_work++;
    	global_atomic_var_work++;

    	if(global_var != 2) {
    		if(local_var_work != global_atomic_var_work) {
    			PRINTF("Task switch occurred at 0x%x cycle of task 02\r\n",i);
    		}
			global_var = 2;
    	}
    	i++;
    }
}

// Function that implements the task being created.
void vTaskCode( void * pvParameters )
{
    // The parameter value is expected to be 1 as 1 is passed in the
    // pvParameters value in the call to xTaskCreateStatic().
    configASSERT( ( uint32_t ) pvParameters == 1UL );

    uint8_t array_ch[5];
    uint8_t rtc_data;
    uint8_t retVal;
    uint8_t rtc_data_array[7];

    while (1)
    {
//        // ******************************************************************************************
//        // from serial DEFAULT
//        USART_WriteBlocking(DEMO_USART, txbuff, sizeof(txbuff) - 1);
//        // waiting start test: press any key on st_link (minicom - lpcxpresso54608) terminal
//        USART_ReadBlocking (DEMO_USART, &ch, 1);
//        txbuff_show_rx[25] = ch;
//        USART_WriteBlocking(DEMO_USART, txbuff_show_rx, sizeof(txbuff_show_rx) - 1);

        // ******************************************************************************************
        // from serial/rs485 MARCO_TEST
        // N.B.:
        //       - marrone sul led2 (port3 - pin3) accoppiato a sw2 -> DE
        //       - bianco  sul led3 (port2 - pin2) accoppiato a sw3 -> RE
        // ******************************************************************************************
        // first message
        //USART_WriteBlocking(DEMO_USART_MARCO_TEST, txbuff_marco, sizeof(txbuff_marco) - 1);
        rsSerial::Tx(txbuff_marco);

        // ******************************************************************************************
        // tx disable
        GPIO_PinWrite(GPIO, APP_BOARD_MARCO_TEST_LED2_PORT, APP_BOARD_MARCO_TEST_LED2_PIN, 0);
        // rx enable
        GPIO_PinWrite(GPIO, APP_BOARD_MARCO_TEST_LED3_PORT, APP_BOARD_MARCO_TEST_LED3_PIN, 0);

        // waiting start RS485 RX test: press any key on minicom (by minicom.rs485_dsdtech) terminal
        // USART_ReadBlocking(DEMO_USART_MARCO_TEST, array_ch, size_of(array_ch));
        rsSerial::Rx(array_ch, sizeof(array_ch) - 1);

        txbuff_marco[0] = array_ch[0];
        txbuff_marco[1] = array_ch[1];
        txbuff_marco[2] = array_ch[2];
        txbuff_marco[3] = array_ch[3];

        txbuff_marco[4] = ' ';
        txbuff_marco[5] = '-';
        txbuff_marco[6] = ' ';

        PRINTF("Rx data from rs485 : %02d - %02d - %02d - %02d\r\n",	array_ch[0],
        		array_ch[1],
				array_ch[2],
				array_ch[3]
    			);

        if (array_ch[0] == 'w') {
        	if ( (array_ch[2] >= 0x30) && (array_ch[2] <= 0x39) &&
        		 (array_ch[3] >= 0x30) && (array_ch[3] <= 0x39) ) {
        		rtc_data = (array_ch[2] - 0x30) * 10 + (array_ch[3] - 0x30);

