MuraDaco/mpfw_code_main_tst_20240619main/src/nxp/Src/LPC54608_tst_freertos_original.cpp
                if (array_ch[1] == 'h') {
                	ds3231_set	(HOUR,   &rtc_data);
                } else
                if (array_ch[1] == 'm') {
                	ds3231_set	(MINUTE, &rtc_data);
                } else
                if (array_ch[1] == 's') {
                	ds3231_set	(SECOND, &rtc_data);
                }

                rtc_data_array[0] = 0;	// seconds
                rtc_data_array[1] = 0;	// minutes
                rtc_data_array[2] = 0;	// hours
                rtc_data_array[3] = 0;	// week day
                rtc_data_array[4] = 0;	// day
                rtc_data_array[5] = 0;	// month
                rtc_data_array[6] = 0;  // year

                retVal = ds3231_read	(TIME, rtc_data_array);
                PRINTF("ds3231_read status retVal: %d\r\n",retVal);

                PRINTF("Rx data from rs485 : %d/%d/%d/ - %d - %d:%d:%d\r\n",	rtc_data_array[4],
                					    										rtc_data_array[5],
            																	rtc_data_array[6],
            																	rtc_data_array[3],
            																	rtc_data_array[2],
            																	rtc_data_array[1],
            																	rtc_data_array[0]
            			);
        	}
        }

        if (array_ch[0] == 'x') {
        	vTaskSuspend(NULL);
        } else
        if (array_ch[0] == 'r') {
            retVal = ds3231_read	(TIME, rtc_data_array);
            PRINTF("ds3231_read status retVal: %d\r\n",retVal);

            PRINTF("Rx data from rs485 : %d/%d/%d/ - %d - %d:%d:%d\r\n",	rtc_data_array[4],
            					    										rtc_data_array[5],
        																	rtc_data_array[6],
        																	rtc_data_array[3],
        																	rtc_data_array[2],
        																	rtc_data_array[1],
        																	rtc_data_array[0]
																						   );
        }


        // tx enable
        GPIO_PinWrite(GPIO, APP_BOARD_MARCO_TEST_LED2_PORT, APP_BOARD_MARCO_TEST_LED2_PIN, 1);
        // rx disable
        GPIO_PinWrite(GPIO, APP_BOARD_MARCO_TEST_LED3_PORT, APP_BOARD_MARCO_TEST_LED3_PIN, 1);
    }


    for( ;; )
    {
        // Task code goes here.
    }
}

void uart_task(void *pvParameters)
{
    int error;
    size_t n            = 0;
    usart_config.srcclk = BOARD_DEBUG_UART_CLK_FREQ;
    usart_config.base   = DEMO_USART;

    NVIC_SetPriority(DEMO_USART_IRQn, USART_NVIC_PRIO);

    if (0 > USART_RTOS_Init(&handle, &t_handle, &usart_config))
    {
        vTaskSuspend(NULL);
    }

    /* Send introduction message. */
    if (0 > USART_RTOS_Send(&handle, (uint8_t *)to_send, strlen(to_send)))
    {
        vTaskSuspend(NULL);
    }

    /* Receive user input and send it back to terminal. */
    do
    {
        error = USART_RTOS_Receive(&handle, recv_buffer, sizeof(recv_buffer), &n);
        if (error == kStatus_USART_RxRingBufferOverrun)
        {
            /* Notify about hardware buffer overrun */
            if (kStatus_Success !=
                USART_RTOS_Send(&handle, (uint8_t *)send_buffer_overrun, strlen(send_buffer_overrun)))
            {
                vTaskSuspend(NULL);
            }
        }
        if (n > 0)
        {
            /* send back the received data */
            USART_RTOS_Send(&handle, (uint8_t *)recv_buffer, n);
        }
    } while (kStatus_Success == error);

    USART_RTOS_Deinit(&handle);
    vTaskSuspend(NULL);
}


// Function that creates a task.
void vOtherFunction( void )
{
    TaskHandle_t xHandle = NULL;

    // Create the task without using any dynamic memory allocation.
    xHandle = xTaskCreateStatic(
    		      uart_task,             // Function that implements the task.
                  "NAME",                // Text name for the task.
                  STACK_SIZE,            // Stack size in words, not bytes.
                  ( void * ) 1,          // Parameter passed into the task.
				  uart_task_PRIORITY,    // Priority at which the task is created.
                  xStack,                // Array to use as the task's stack.
                  &xTaskBuffer );        // Variable to hold the task's data structure.

    // puxStackBuffer and pxTaskBuffer were not NULL, so the task will have
    // been created, and xHandle will be the task's handle.  Use the handle
    // to suspend the task.
    vTaskSuspend( xHandle );
}

/*!
 * @brief Task responsible for loopback.
 */
/*
 * @brief   Application entry point.
 */
int main(void) {
    CLOCK_AttachClk(BOARD_DEBUG_UART_CLK_ATTACH);


//    // ***************************************************************************
//    rsSerial::Tx("START  - Init static functions"); rsSerial::Tx(rsSerial::endl);
//    rsSerial::Tx(rsSerial::endl);
    krInitStaticManager::LoopOnUnits(ap_krInitStaticTbl::krInitStaticPtrArray);
    rsSerial::Tx(rsSerial::endl);

    /* attach 12 MHz clock to FLEXCOMM8 (I2C master) */
    CLOCK_AttachClk(kFRO12M_to_FLEXCOMM8);
    /* reset FLEXCOMM for I2C */
    RESET_PeripheralReset(kFC8_RST_SHIFT_RSTn);
    BOARD_InitBootPins();


    /* Init board hardware. */
    /* attach 12 MHz clock to FLEXCOMM0 (debug console) */
    /* attach 12 MHz clock to FLEXCOMM0 (debug console) */
    // CLOCK_AttachClk(BOARD_DEBUG_UART_MARCO_TEST_CLK_ATTACH);
    // BOARD_BootClockPLL180M();
    BOARD_InitDebugConsole();


    // ***************************************************************************
    // ...........1234567890123456789012345678901234567890
    rsSerial::Tx("START  - Main"); rsSerial::Tx(rsSerial::endl);

    // ***************************************************************************
    // ...........1234567890123456789012345678901234567890
    rsSerial::Tx("START  - Setup Timer Service"); rsSerial::Tx(rsSerial::endl);
    rsSerial::Tx(rsSerial::endl);
    krTimerManager::SetUnitPtrArrayPtr(ap_krTimerTbl::TimerPtrArray);
    rsSerial::Tx(rsSerial::endl);

    // ***************************************************************************
    // ...........1234567890123456789012345678901234567890
    rsSerial::Tx("START  - Setup State Machine Service"); rsSerial::Tx(rsSerial::endl);
    rsSerial::Tx(rsSerial::endl);
    svStateMachineManager::SetUnitsArrayPtr(ap_svStateMachineTbl::UnitsArray);
    rsSerial::Tx(rsSerial::endl);

