MuraDaco/mpfw_code_main_tst_20240619main/src/nxp/Src/LPC54608_tst_freertos_original.cpp
/*
    // ***************************************************************************
    rsSerial::Tx("START  - Threads definition and then run them"); rsSerial::Tx(rsSerial::endl);
    rsSerial::Tx(rsSerial::endl);
    krThreadManager::InitThenRun(ap_krThreadTbl::LoopFunctionArray);
    rsSerial::Tx(rsSerial::endl);

    do {
        wp_sleep_for(10);
    } while (tt_mn_svSyncMain::CheckRaceConditionCounter(10));
    
    // ***************************************************************************
    krThreadManager::Exit();
    rsSerial::Tx("EXIT  - from Main Loop"); rsSerial::Tx(rsSerial::endl);
    rsSerial::Tx(rsSerial::endl);
    rsSerial::Tx(rsSerial::endl);

    // ***************************************************************************
    rsSerial::Tx("SHOW  - Tests results"); rsSerial::Tx(rsSerial::endl);
    rsSerial::Tx(rsSerial::endl);
    tt_MainManager::LoopOnUnits();
    rsSerial::Tx(rsSerial::endl);
// *****************************************************
*/
    /* Force the counter to be placed into memory. */
    volatile static int i = 0 ;


// ****
    // uint8_t ch;
//    usart_config_t config;

/*
    // BOARD_InitPins();
    // BOARD_BootClockPLL180M();
    // BOARD_InitDebugConsole();


    GPIO_PortInit(GPIO, APP_BOARD_MARCO_TEST_SW2_PORT );
    GPIO_PortInit(GPIO, APP_BOARD_MARCO_TEST_LED2_PORT);

    GPIO_PortInit(GPIO, APP_BOARD_MARCO_TEST_SW3_PORT );
    GPIO_PortInit(GPIO, APP_BOARD_MARCO_TEST_LED3_PORT);


    // Define the init structure for the output LED pin
    gpio_pin_config_t led_config = {
        kGPIO_DigitalOutput,
        0,
    };

    GPIO_PinInit (GPIO, APP_BOARD_MARCO_TEST_LED2_PORT, APP_BOARD_MARCO_TEST_LED2_PIN, &led_config);
    // rs485 tx enable
    GPIO_PinWrite(GPIO, APP_BOARD_MARCO_TEST_LED2_PORT, APP_BOARD_MARCO_TEST_LED2_PIN, 1);

    GPIO_PinInit (GPIO, APP_BOARD_MARCO_TEST_LED3_PORT, APP_BOARD_MARCO_TEST_LED3_PIN, &led_config);
    // rs485 rx disable
    GPIO_PinWrite(GPIO, APP_BOARD_MARCO_TEST_LED3_PORT, APP_BOARD_MARCO_TEST_LED3_PIN, 1);
*/
    /*
     * config.baudRate_Bps = 115200U;
     * config.parityMode = kUSART_ParityDisabled;
     * config.stopBitCount = kUSART_OneStopBit;
     * config.loopback = false;
     * config.enableTx = false;
     * config.enableRx = false;
     */
/*
    USART_GetDefaultConfig(&config);
    config.baudRate_Bps = BOARD_DEBUG_UART_BAUDRATE;
    config.enableTx     = true;
    config.enableRx     = true;

    // USART_Init(DEMO_USART,            &config, DEMO_USART_CLK_FREQ             );
    USART_Init(DEMO_USART_MARCO_TEST, &config, DEMO_USART_MARCO_TEST_CLK_FREQ  );
*/
    // USART_WriteBlocking(DEMO_USART,            txbuff_first_msg, sizeof(txbuff_first_msg) - 1);
    USART_WriteBlocking(DEMO_USART_MARCO_TEST, txbuff_first_msg, sizeof(txbuff_first_msg) - 1);


// ****
    uint8_t rtc_data_array[7];
    uint8_t rtc_data_array_rx[7];

    PRINTF("Receive sent data from slave :\r\n");

    status_t retVal        = kStatus_Fail;
    ds3231_I2C_init();
    retVal = ds3231_init_status_report();
    PRINTF("ds3231_init_status_report retVal: %d\r\n",retVal);

    // rtc_data_array[0] = 43;	// seconds
    // rtc_data_array[1] = 46;	// minutes
    // rtc_data_array[2] =  9;	// hours
    // rtc_data_array[3] =  1;	// week day
    // rtc_data_array[4] = 29;	// day
    // rtc_data_array[5] =  8;	// month
    // rtc_data_array[6] = 22;  // year

    PRINTF("Tx data to slave : %d/%d/%d/ - %d - %d:%d:%d\r\n",	rtc_data_array[4],
    															rtc_data_array[5],
																rtc_data_array[6],
																rtc_data_array[3],
																rtc_data_array[2],
																rtc_data_array[1],
																rtc_data_array[0]
			);

    retVal = ds3231_init(rtc_data_array, CLOCK_RUN, NO_FORCE_RESET);
    PRINTF("ds3231_init status retVal: %d\r\n",retVal);

    // retVal = ds3231_set	(TIME, rtc_data_array);
    // PRINTF("ds3231_set status retVal: %d\r\n",retVal);

    retVal = ds3231_run_status	();
    PRINTF("ds3231_run_status status retVal: %d\r\n",retVal);

    if (kStatus_DS3231_Clock_Halt == retVal) {
        retVal = ds3231_run_command	(CLOCK_RUN);
        PRINTF("ds3231_run_command status retVal: %d\r\n",retVal);

        retVal = ds3231_run_status	();
        PRINTF("ds3231_run_status status retVal: %d\r\n",retVal);
    }

    rtc_data_array_rx[0] = 0;	// seconds
    rtc_data_array_rx[1] = 0;	// minutes
    rtc_data_array_rx[2] = 0;	// hours
    rtc_data_array_rx[3] = 0;	// week day
    rtc_data_array_rx[4] = 0;	// day
    rtc_data_array_rx[5] = 0;	// month
    rtc_data_array_rx[6] = 0;  // year

    retVal = ds3231_read	(TIME, rtc_data_array_rx);
    PRINTF("ds3231_read status retVal: %d\r\n",retVal);

    PRINTF("Rx data from slave : %d/%d/%d/ - %d - %d:%d:%d\r\n",	rtc_data_array_rx[4],
    					    										rtc_data_array_rx[5],
																	rtc_data_array_rx[6],
																	rtc_data_array_rx[3],
																	rtc_data_array_rx[2],
																	rtc_data_array_rx[1],
																	rtc_data_array_rx[0]
			);



// ****


//	TaskHandle_t xTaskCreateStatic(	TaskFunction_t pxTaskCode,
//									const char * const pcName,		/*lint !e971 Unqualified char types are allowed for strings and single characters only. */
//									const uint32_t ulStackDepth,
//									void * const pvParameters,
//									UBaseType_t uxPriority,
//									StackType_t * const puxStackBuffer,
//									StaticTask_t * const pxTaskBuffer )

//	BaseType_t xTaskCreate(	TaskFunction_t pxTaskCode,
//							const char * const pcName,		/*lint !e971 Unqualified char types are allowed for strings and single characters only. */
//							const configSTACK_DEPTH_TYPE usStackDepth,
//							void * const pvParameters,
//							UBaseType_t uxPriority,
//							TaskHandle_t * const pxCreatedTask )

    PRINTF("Start example BARE01 xTaskCreateStatic.\r\n");
    if (xTaskCreate(uart_task, "Uart_task", configMINIMAL_STACK_SIZE + 100, NULL, uart_task_PRIORITY, NULL) != pdPASS)
    {
        PRINTF("Task creation failed!.\r\n");
        while (1)
            ;
    }

    if (xTaskCreateStatic(vTaskCode ,"Uart_static_task",STACK_SIZE,( void * ) 1,uart_task_PRIORITY,xStack,&xTaskBuffer ) == NULL)
    {
        PRINTF("Task creation failed!.\r\n");
        while (1)
            ;
    }

//    vOtherFunction();
    vTaskStartScheduler();
    /* Enter an infinite loop, just incrementing a counter. */
    while(1) {
        i++ ;
        /* 'Dummy' NOP to allow source level single stepping of
            tight while() loop */
        __asm volatile ("nop");
    }

    return 0 ;
}


